app/controllers/urls_controller.rb

INSERT INTO "urls" ("original_url", "short_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["original_url", "https://example.com"], ["short_code", "65462e"], ["created_at", "2023-06-11 14:08:11.893390"], ["updated_at", "2023-06-11 14:08:11.893390"]]
---
  def create
    @url = Url.new(url_params)
    if @url.save

SELECT "urls".* FROM "urls" WHERE "urls"."short_code" = $1 LIMIT $2  [["short_code", "short_code"], ["LIMIT", 1]]
---
  def redirect
    @url = Url.find_by(short_code: params[:short_code])